Revit 2027 API
ElementIntersectsFilter.IsCategorySupported Method
 Identifies if the input element is of a category supported by element intersection filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCategorySupported(
	Element element
)
Public Shared Function IsCategorySupported (
	element As Element
) As Boolean
public:
static bool IsCategorySupported(
	Element^ element
)
static member IsCategorySupported :
        element : Element -> bool
Parameters
element Element
 The element.
Return Value
Boolean
 True if the element category is supported, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace